let pars = '№,Наименование,Цена,Розн.,Очки\n' +
    ',    БАДы                ,,,\n' +
    '1,"Экстра Бетулин 7.5г     ",269,449,312\n' +
    '2,БАД АпиКрасота 180 г     ,564,942,656\n' +
    '3,БАД ХИП Сезона          ,331,553,384\n' +
    '4,Черника Поллен 180 г     ,509,850,592\n' +
    '5,БАД "ЭРГО кальций"     ,358,598,416\n' +
    '6,"Прополис С 150 г         ",321,536,372\n' +
    ',    Бальзамы            ,,,     \n' +
    '7,Апибальзам 1 100 мл      ,210,350,244\n' +
    '8,Апибальзам 1 15 мл       ,90,150,104\n' +
    '9,"Апибальзам-2  50 г       ",149,248,173\n' +
    '10,"АпиХит  15 мл           ",160,267,186\n' +
    '11,"Ассиль 100 мл           ",160,267,186\n' +
    '12,"Продукт №3  200 мл       ",614,1025,714\n' +
    '13,"Продукт №3  100 мл       ",362,604,421\n' +
    '14,"Продукт №1  15 г         ",91,152,102\n' +
    '15,Сбитень Имбирь 280 г     ,266,443,309\n' +
    '16,"Хинази 200 мл           ",312,521,362\n' +
    '17,Сироп Сорбус  240 г     ,321,536,372\n' +
    '18,"Эй-Пи-Ви 100 мл        ",274,458,318\n' +
    '19,"Эй-Пи-Ви 15 мл         ",78,130,87\n' +
    '20,"Эй-Пи-Ви 200 мл        ",538,898,626\n' +
    ',Драже               ,,,     \n' +
    '21,"Апи-Спира 180 г         ",369,616,429\n' +
    '22,"Апи-Спира 300 г         ",507,847,589\n' +
    '23,Апиформула3 з/с 300 г    ,477,797,554\n' +
    '24,Апи-Элите 180 г          ,244,408,284\n' +
    '25,Апи-Элите  300 г        ,335,559,389\n' +
    '26,БифидоХлебина 300 г     ,715,1194,832\n' +
    '27,Брусника 180 г          ,655,1094,762\n' +
    '28,"ГепатоЛинум 300 г      ",619,1033,720\n' +
    '29,"Молочко трутневое 5 г    ",25,42,29\n' +
    '30,"Тенториум Плюс 180 г    ",368,614,428\n' +
    '31,"Тенториум Плюс 300 г    ",552,921,641\n' +
    '32,"Драже "Хлебина" 300 г    ",623,1040,724\n' +
    '33,"Драже "Черника" 180 г    ",463,773,538\n' +
    '34,"Драже "Черника" 300 г    ",758,1267,882\n' +
    '35,Экстра Беф. мягк 150    ,317,529,368\n' +
    '36,Экстра Беф. мягк 250    ,495,826,576\n' +
    '37,Драже Ягодный бум       ,523,873,608\n' +
    '38,"Молочко трутн. 180 г    ",1300,2170,1512\n' +
    '39,О-ДЕ-ВИТ 180 г          ,300,501,349\n' +
    '40,О-ДЕ-ВИТ 300 г          ,400,667,465\n' +
    '41,"ПропоЛит 180 г          ",304,508,354\n' +
    '42,"ПропоЛит 300 г          ",434,724,504\n' +
    '43,Сорбус 250 г new        ,321,536,372\n' +
    '44,"BeeActive 280 г         ",1002,1673,1166\n' +
    '45,"Формула Ра з/с  300 г",548,914,636\n' +
    '46,Формула Ра 180г       ,291,486,339\n' +
    '47,"Формула Ра 300 г        ",416,695,484\n' +
    '48,"Экстра-Лор 180 г       ",261,436,303\n' +
    '49,"Экстра-Лор 300 г       ",362,604,421\n' +
    ',Медовые композиции,,,     \n' +
    '50,"АКТВ  100 г              ",360,600,418\n' +
    '51,Апиток 300 г new         ,525,876,611\n' +
    '52,Апитонус 300 г           ,525,876,611\n' +
    '53,Апифитотонус 300 г      ,541,904,629\n' +
    '54,Мёд Парма 500 г          ,314,525,0\n' +
    '59,Мед Пчелиный 1000 г      ,476,795,0\n' +
    '61,"Мед с лецитином 300 г    ",302,504,351\n' +
    '62,Мед с мумие 300 г       ,406,678,472\n' +
    '63,Мед цветочный 450 г     ,400,667,0\n' +
    '65,Жизненная сила+ 400 г    ,909,1519,1058\n' +
    '66,"Полянка 300г           ",347,580,404\n' +
    '67,Тополек 300 г new       ,382,639,444\n' +
    ',Крем - мази,,,     \n' +
    '68,"Апи-Бюст 50мл          ",164,274,223\n' +
    '69,Апи-бюст Ovotelle       ,212,353,246\n' +
    '70,"Апи-Крем 50 мл          ",192,321,223\n' +
    '71,"Витус-Фактор 50 мл      ",192,321,223\n' +
    '72,"Тенториум 100 мл        ",379,633,424\n' +
    '73,"Тенториум 30 мл         ",150,251,168\n' +
    '74,"Тенториум 50 мл         ",210,351,234\n' +
    '75,"Рино-Фактор 15 мл       ",203,339,236\n' +
    '76,Чилидония Ovotelle      ,181,302,210\n' +
    ',Программы  ,,,     \n' +
    '77,Антистрессовая прог.    ,547,913,636\n' +
    '78,Жизненная сила          ,2772,4629,3226\n' +
    '79,ЖКТ-Ультра              ,343,572,399\n' +
    '80,F25 Activation          ,2815,4702,3276\n' +
    '81,Прог-ма поддерж. здр    ,875,1461,1017\n' +
    ',  Косметические средства,,,\n' +
    '82,Бальзам для губ 10 мл    ,165,276,192\n' +
    '83,Гель увл.д/чувст.зон    ,159,265,184\n' +
    '84,Крем для рук 50 мл       ,169,282,196\n' +
    '85,Молочко очищ. 75 мл      ,176,293,204\n' +
    '86,Увл. молочко д/тела     ,228,381,265\n' +
    '87,Крем днев. пит. 50 мл    ,221,369,256\n' +
    '88,Крем ночной питат       ,234,390,272\n' +
    '89,Крем Экстрим 15 мл      ,190,317,220\n' +
    '90,Крем-гель д/век 10 мл    ,138,230,160\n' +
    '91,Масло гидроф-е 15 мл    ,71,118,82\n' +
    '92,Тоник освежающий        ,190,317,221\n' +
    '93,Альгин.маска/пропол/пелоид/хитозан    ,170,284,198\n' +
    ',Пеномоющая продукция,,,     \n' +
    '94,Бальзам д/волос         ,183,306,213\n' +
    '95,Гель Мускус-Унисекс     ,169,282,196\n' +
    '96,Гель д/душа Мед.дыня    ,237,396,276\n' +
    '97,"Жидкое мыло ""Персик""    ",190,317,220\n' +
    '98,Масло гидр. /пыльца     ,373,623,433\n' +
    '99,Присыпка Люкс-про       ,120,200,139\n' +
    '100,Шампунь укреп. 250 мл    ,237,396,276\n' +
    ',Средства для ухода за полостью рта,,,     \n' +
    '101,"Апидент з/паста 100 г",118,197,137\n' +
    '102,Гель д/десен с пч.яд    ,115,192,128\n' +
    '103,Ополаскиватель д/рта    ,236,393,273\n' +
    ',Концентраты пищевые,,,     \n' +
    '104,Концентрат BNRG LADY    ,755,1261,824\n' +
    '105,Концент-т BNRG SPORT    ,1116,1864,1218\n' +
    '106,Кофе с прополисом       ,210,350,244\n' +
    '107,Крамбамбуля с пропол    ,185,309,215\n' +
    '108,Коктейль ТриО           ,481,804,560\n' +
    '109,Соль пищ. с хитозан.    ,281,470,327\n' +
    ',Свечи               ,,,     \n' +
    '110,Абиес-свечи 2 шт         ,42,70,12\n' +
    '111,Масло для тела 15 г      ,129,216,113\n' +
    '112,Св.воск Кандела 1 шт     ,50,83,11\n' +
    '113,Свеча вощинная          ,38,64,12\n' +
    ',Репеллент,,,     \n' +
    '114,Репеллент  20 г          ,233,389,280\n' +
    ',Пелоид              ,,,     \n' +
    '115,Пелоид осиновоозерс.    ,109,182,126\n' +
    ',Крупяной концентрат ,,,     \n' +
    '116,Апицампа гречишная      ,289,483,336\n' +
    '117,Апицампа кукурузная     ,203,339,236\n' +
    '118,Апицампа рисовая        ,174,291,202\n' +
    '119,Апицампа ячменная       ,160,267,186\n';

function parseString(pars) {
    let arrOfRows = pars.split('\n');
    return arrOfRows;

}

function parseElemInString(arr) {
    for (let i=0; i<arr.length; i++) {
        arr[i]=arr[i].split(',');
    }
    return arr;
}

function generateRows(arr) {
    let row='';
    for (let i=0; i<arr.length;i++){
        for (let j=0; j<arr[i].length;j++) {

            row+=`<div class="elem${j}">${arr[i][j]}</div>`;

        }
        $('#cont').append(`<div class="roww">${row}</div></br>`);
        row='';
    }

}

generateRows(parseElemInString(parseString(pars)));



console.log(parseElemInString(parseString(pars)));